:PROPERTIES:
:header-args: :eval no :exports both
:END:
#+TITLE: AoC 2022
#+SUBTITLE: My solutions for Advent of Code 2022
#+AUTHOR: Rens Oliemans
#+OPTIONS: toc:nil ^:t num:nil

Welcome to my solution page for [[https://adventofcode.com/2022][Advent of Code 2022]]. You can find [[https://codeberg.org/RensOliemans/AoC][the git repo here]].
** Part 1
First, let's parse properly. I want each a list of sequences: the list of stacks of crates.
#+begin_src clojure
  (defn parse-crates
    "Takes a block and returns the columns of crate letters."
    [block]
    (let [rows (-> block s/parse-lines butlast)
          cols (v/transpose rows)]
      (keep-indexed
       (fn [i col]
         (when (= 1 (mod i 4))
           (remove #{\space} col)))
       cols)))

  (defn- parse-procedure [line]
    (let [[_ a f t] (re-find #"move (\d+) from (\d+) to (\d+)" line)]
      {:amount (parse-long a)
       :from   (dec (parse-long f))
       :to     (dec (parse-long t))}))

  (defn- parse-procedures [block]
    (map parse-procedure (s/parse-lines block)))
#+end_src

We parse the crates like this:

#+NAME: parse-crates
#+begin_src clojure :eval no-export :cache yes
  (aoc.2022.day05/parse-crates
  "    [D]    
  [N] [C]    
  [Z] [M] [P]
   1   2   3 
  ")
#+end_src

#+RESULTS[73f10b23e88252278a087d1c060c0bcf259b18e3]: parse-crates
: ((\N \Z) (\D \C \M) (\P))

We now have to apply each procedure, one by one, and find the result (the character of the crate that ends up on top of each stack).

See the following two parts:
#+NAME: conj-to-seq
#+begin_src clojure :eval yes
  (conj '(1 2 3) 4)
#+end_src

#+RESULTS: conj-to-seq
: (4 1 2 3)

#+NAME: drop-from-seq
#+begin_src clojure :eval yes
  (drop 2 '(1 2 3 4 5 6))
#+end_src

#+RESULTS: drop-from-seq
: (3 4 5 6)

Which is fantastic, since we can just =conj= and =drop= and the stacks will be moved as they should, one-by-one. Here's the rest of part one:

#+begin_src clojure
  (defn- apply-procedure
    "Applies a procedure to a list of stacks."
    [crane stacks {:keys [amount from to]}]
    (let [src (nth stacks from)
          tomove (take amount src)
          tomove (if (= crane :CrateMover9001) (reverse tomove) tomove)]
      (-> stacks
          vec
          (assoc from (drop amount src))
          (update to #(apply conj % tomove)))))

  (defn- result [input crane]
    (let [[crates-block procedures-block] (s/parse-blocks input)]
      (->> (parse-procedures procedures-block)
           (reduce (partial apply-procedure crane)
                   (parse-crates crates-block))
           (map first)
           (apply str))))

  (defn part1 [input] (result input :CrateMover9000))
#+end_src

This is of course not my initial iteration, as you might see from the /CraneMover9001/. Oops, spoilers for
